view.index.title=Mateusz Zweigert
view.index.lang=English
view.index.welcome=Strona domowa
view.index.menu=Menu
view.index.experience=Do\u015Bwiadczenie
view.index.skills=Umiej\u0119tno\u015Bci
view.index.projects=Projekty
view.index.contact=Kontakt
view.index.about_me=O mnie
view.index.and=i

view.index.desc.header=Witam wszystkich na mojej stronie
view.index.desc.about_me=Mam na imi\u0119 Mateusz i mam 25 lat. Obecnie mieszkam w Gda\u0144sku, pracuj\u0119 \
  jako Junior Java Developer w firmie BEST S.A. Uko\u0144czy\u0142em studia wy\u017csze na Uniwersytecie Gda\u0144skim z tytu\u0142em magistra. \
  Interesuj\u0119 si\u0119 tworzeniem gier w silniku graficznym Unity3D, tworzeniem serwis\u00f3w internetowych, j\u0119zykiem Java jak i zwi\u0105zanego z nim\
  bibliotekami oraz frameworkami. W wolnym czasie gram w tenisa sto\u0142owego, p\u0142ywam, biegam, je\u017cd\u017c\u0119 na rowerze, buduj\u0119 LEGO oraz odpoczywam na pla\u017cy.
view.index.desc.checkout=Zapraszam do obejrzenia
view.index.desc.projects=moich projekt\u00f3w
view.index.desc.skills=moich umi\u0119j\u0119tno\u015Bci
view.index.github=Github'ie
view.index.visit_me=Odwied\u017A mnie na
view.index.facebook=Facebook'u
view.index.linkedIn=LinkedIn'ie
view.index.copyright=Copyright © Mateusz Zweigert 2018.

view.experience.title=Moje do\u015Bwiadczenie 
view.experience.period=Okres: 
view.experience.company=Firma: 
view.experience.what_i_did=Co robi\u0142em? 
view.experience.what_i_do=Co robi\u0119?  
view.experience.text_stack=Stack technologiczny

view.experience.frontend_intern.title=Praktyki frontend
view.experience.frontend_intern.period=03.08.2015 - 30.08.2015
view.experience.frontend_intern.company=PGS Software
view.experience.frontend_intern.desc=Tworzenie wewn\u0119trznej serwisu biblioteki ksi\u0105\u017Cek.

view.experience.java_intern.title=Sta\u017C jako programista Java
view.experience.java_intern.period=30.09.2016 - 30.12.2016
view.experience.java_intern.company=BEST S. A.
view.experience.java_intern.desc=Rozwijanie serwisu internetowego wspieraj\u0105cego prac\u0119 windykacji terenowej


view.experience.java_junior_dev.title=M\u0142odszy programista Java
view.experience.java_junior_dev.period=30.12.2016 - obecnie
view.experience.java_junior_dev.company=BEST S. A.
view.experience.java_junior_dev.desc=Tworzenie oraz rozwijanie wewn\u0119trznego systemu operacyjnego dla pracownik\u00F3w firmy.

view.projects.title=Moje projekty
view.projects.seemore=Zobacz wi\u0119cej
view.projects.seeingp=Zobacz w Google Play
view.projects.tap_the_dots.title=Tap The Dots
view.projects.tap_the_dots.desc=Tap The Dots to gra typu casual z bardzo prostymi zasadami. \
  G\u0142ownym motywem gry s\u0105 s\u0142awne internetowe memy takie jak smutna \u017caba lub piese\u0142. \
  Gracz musi bardzo szybko klika\u0107 w kropki takiego koloru, jak pasek znajduj\u0105cy si\u0119 na g\u00f3rze. \
  Wi\u0119cej informacji znale\u017A\u0107 mo\u017cna klikaj\u0105c przycisk na dole.
view.projects.framelimiter.title=Frame Limiter
view.projects.framelimiter.desc=Frame Limiter to pierwsza gra, kt\u00f3r\u0105 stworzy\u0142em w silniku graficznym Unity3D \
  Zasady gry s\u0105 bardzo proste. \
  Gracz porusza czerwonymi klockami znajduj\u0105cymi si\u0119 na brzegach planszy, tak aby \
  pi\u0142ka nie wypad\u0142a poza ni\u0105. \
  U\u017cytkownik zbiera power-upy, kt\u00f3re spadaj\u0105 zawsze kiedy pi\u0142ka jest w ruchu. \
  W grze dost\u0119pne s\u0105 2 tryby sterowania, poprzez dotykowy krzy\u017cak oraz sam dotyk. \ 
view.projects.fractal_reality.title=Fractal reality
view.projects.fractal_reality.desc=Fractal reality to aplikacja wirtualnej rzeczywisto\u015Bci, w kt\u00f3rej \
  u\u017cytkownik ma do wyboru sze\u015B\u0107 fraktalnych sfer, kt\u00f3r\u0119 zostaj\u0105 na\u0142o\u017cone na kamer\u0119 i imituj\u0105 \
  halucynogenne postrzeganie \u015Bwiata. Aplikacja ta tak jak poprzednie zosta\u0142a zrobiona w silniku\
  graficznym Unity3D. \ 
view.projects.cops_and_robbers.title=Cops-and-robbers
view.projects.cops_and_robbers.desc=Projekt zrealizowany jako cz\u0119\u015B\u0107 pracy magisterskiej, \
   sk\u0142ada si\u0119 on z dw\u00F3ch modu\u0142\u00F3w: \n \
   graphrodite - biblioteka s\u0142u\u017C\u0105ca do wykonywania operacji na grafach np. takich jak tworzenie \
   i ich reprezentacja, szukanie cykli itd. \
   cops-and-robber - modu\u0142 zawieraj\u0105cy algorytmy zwi\u0105zane z gr\u0105 na grafach w policjant\u00F3w i z\u0142odziei, \
   obliczaj\u0105ce liczb\u0119 policjant\u00F3w potrzebnych by z\u0142apa\u0107 z\u0142odzieja na danym grafie.
view.projects.library.title=Biblioteka
view.projects.library.desc=Projekt biblioteki to prosty CRUD w kt\u00f3rym u\u017cytkownik, mo\u017ce wykonywa\u0107 operacje na tabelach bazy danych \
  z poziomu swojej przegl\u0105darki. \
  Serwis internetowy zosta\u0142 zrobiony dzi\u0119ki technologi Java Enterprise Edition. \
  Je\u015Bli ktokolwiek chc\u0119 skorzysta\u0107 z projektu, musi zainstalowa\u0107 server GlassFish, a nast\u0119pnie \
  uruchomi\u0107 skrypty uruchamuiaj\u0105ce lokaln\u0105 baz\u0119 danych HSQL, kt\u00f3re \
  znajduj\u0105 si\u0119 w katalogu scripts. Wi\u0119cej informacji w pliku readme.rd \
  Na projekt sk\u0142ada si\u0119 strona serverowa aplikacji (foldery domains, services, rest) oraz kliencka (html, js, css).
view.projects.computershop.title=Sklep komputerowy
view.projects.computershop.desc=Sklep komputerowy zosta\u0142 zrobiony we frameworku ASP.NET MVC. \
  Projekt ten, jest serwisem, kt\u00f3ry mog\u0105 wykorzystywa\u0107 ma\u0142e sklepy internetowe. \
  Sklep operuje dwoma typami r\u00f3l. Admin ma dost\u0119p do zarz\u0105dzania sprz\u0119tem dost\u0119pnym w sklepie oraz \
  mo\u017ce robi\u0107 w nim zakupy. \
  Drugim typem roli w aplikacji jest normalny u\u017cytkownik, posiadaj\u0105cy jedynie mo\u017cliwo\u015B\u0107 zarz\u0105dzania swoim kontem, koszykiem oraz \
  kupywaniem sprz\u0119tu.
view.projects.horsecomp.title=Zawody konne
view.projects.horsecomp.desc=Zawody konne to projekt, kt\u00f3ry zosta\u0142 zrobiony we frameworku node express. \
  Biblioteki u\u017cyte w projekcie to np. underscore.js, jquery.js, mongoose.js. \
  Aplikacja posiada 3 typy r\u00f3l: admin, s\u0119dzia oraz widz. \
  Admin mo\u017ce zarzadza\u0107 kontami, tabel\u0105 z koniami oraz tabel\u0105 z zawodami. \
  Rol\u0105 s\u0119dzi jest ocenianie koni w zawodach w kt\u00f3rych akutalnie bierze udzia\u0142. \
  Widz mo\u017ce ogl\u0105da\u0107 wyniki koni z zawod\u00f3w, kt\u00f3re trwaj\u0105 lub tych, \
  kt\u00f3re si\u0119 ju\u017c zako\u0144czy\u0142y.

view.skills.title=Moje umiej\u0119tno\u015Bci
view.skills.chart.project_managements=Pierwszy wykres reprezentuj\u0119 znajomo\u015B\u0107 narz\u0119dzi do zarz\u0105dzania projektami
view.skills.chart.languages=Wykres reprezentuj\u0105cy moje umi\u0119j\u0119tno\u015Bci programowania w j\u0119zykach kt\u00f3rych czesto u\u017cywam
view.skills.chart.databases=Wykres reprezentuj\u0105cy moj\u0105 znajomo\u015B\u0107 j\u0119zyk\u00f3w baz danych
view.skills.chart.frameworks.java= Wykres pokazuj\u0105cy ocen\u0119 moich umi\u0119j\u0119tno\u015B\u0107i z framework'\u00f3w j\u0119zyka Java
view.skills.chart.frameworks.java.test=Ostatni wykres reprezentuj\u0105cy poziom wiedzy z bibliotek do testowania w Javie

view.contact.title=Skontaktuj si\u0119 ze mn\u0105
view.contact.form.name=Nazwa
view.contact.form.email=Email
view.contact.form.subject=Temat
view.contact.form.content=Tre\u015B\u0107
view.contact.form.sendbutton=Wy\u015Blij


view.contact.form.valid.name=Nazwa niepoprawna
view.contact.form.valid.email=Email niepoprawny
view.contact.form.valid.subject=Temat niepoprawny
view.contact.form.valid.content=Tre\u015B\u0107 niepoprawna

view.contact.send.success=Wysy\u0142ka emaila powiod\u0142a si\u0119!
view.contact.send.fail=Co\u015B posz\u0142o nie tak z wysy\u0142k\u0105 maila :(


view.error.title=B\u0142\u0105d
view.error.general=Wyst\u0105pi\u0142 b\u0142\u0105d o kodzie {0} dla {1} o wiadomo\u015Bci {2}
view.error.unknown=Wyst\u0105pi\u0142 b\u0142\u0105d na stronie :(

valid.notnull.message=Pole nie mo\u017ce by\u0107 puste.
valid.size.message=Ilo\u015B\u0107 znak\u00f3w musi wynosi\u0107 od {2} do {1}
valid.email.message=Nieprawid\u0142owy email
